app/controllers/hosts_controller.rb

  def index
    @filtro ||= Hash.new
    @filtro[:mac] ||= "PRIMEIRAVEZ"

    unless @filtro[:mac].nil? and @filtro[:mac].blank? and @filtro[:mac]!= "PRIMEIRAVEZ"
      @hosts = Host.search(params[:search])
---
SELECT  "hosts".* FROM "hosts" ORDER BY "hosts"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @host = Host.new(host_params)

    respond_to do |format|
      if @host.save
---
INSERT INTO "hosts" ("mac", "nome", "descricao", "ativo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["mac", "00-4D-84-47-3D-68"], ["nome", "Atheros"], ["descricao", "Notebook CPI"], ["ativo", true], ["created_at", 2016-10-12 17:04:59 UTC], ["updated_at", 2016-10-12 17:04:59 UTC]]

  def update
    respond_to do |format|
      if @host.update(host_params)
---
UPDATE "hosts" SET "ativo" = $1, "validade" = $2, "updated_at" = $3 WHERE "hosts"."id" = $4  [["ativo", true], ["validade", 2017-03-10 15:04:00 UTC], ["updated_at", 2017-03-10 18:02:49 UTC], ["id", 2]]

  def destroy
    @host.destroy
---
DELETE FROM "hosts" WHERE "hosts"."id" = ?  [["id", 2]]

    def set_host
      @host = Host.find(params[:id])
---
SELECT  "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]