app/controllers/host_historicos_controller.rb

SELECT "host_historicos".* FROM "host_historicos" WHERE (id like '%%' )
---
  def index
    @filtro ||= Hash.new
    @filtro[:id] ||= "PRIMEIRAVEZ"

    unless @filtro[:id].nil? and @filtro[:id].blank? and @filtro[:id]!= "PRIMEIRAVEZ"
      @host_historicos = HostHistorico.search(params[:search])

SELECT "hosts".* FROM "hosts"
SELECT "users".* FROM "users"
SELECT "redes".* FROM "redes"
---
  def new
    @host_historico = HostHistorico.new
    @host = Host.all
    @user = User.all
    @rede = Rede.all

SELECT "hosts".* FROM "hosts"
SELECT "redes".* FROM "redes"
---
  def edit
    @host = Host.all
    @user = User.all
    @rede = Rede.all

SELECT "hosts".* FROM "hosts"
SELECT "users".* FROM "users"
SELECT "redes".* FROM "redes"
INSERT INTO "host_historicos" ("host_id", "nova_situacao", "novo_status", "motivo", "descricao", "rede_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
        @host = Host.all
    @user = User.all
    @rede = Rede.all
    @host_historico = HostHistorico.new(host_historico_params)

    respond_to do |format|
      if @host_historico.save

UPDATE "host_historicos" SET "descricao" = ?, "updated_at" = ? WHERE "host_historicos"."id" = ?  [["descricao", "AB"], ["updated_at", 2016-10-17 20:45:00 UTC], ["id", 8]]
---
  def update
    respond_to do |format|
      if @host_historico.update(host_historico_params)

DELETE FROM "host_historicos" WHERE "host_historicos"."id" = ?  [["id", 4]]
---
  def destroy
    @host_historico.destroy

SELECT  "host_historicos".* FROM "host_historicos" WHERE "host_historicos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_host_historico
      @host_historico = HostHistorico.find(params[:id])