app/controllers/redes_controller.rb

SELECT "redes".* FROM "redes" WHERE (nome like '%%' )
---
  def index
    @filtro ||= Hash.new
    @filtro[:nome] ||= "PRIMEIRAVEZ"

    unless @filtro[:nome].nil? and @filtro[:nome].blank? and @filtro[:nome]!= "PRIMEIRAVEZ"
      @redes = Rede.search(params[:search])

INSERT INTO "redes" ("nome", "descricao", "ativa", "grupo_ad", "created_at", "updated_at", "controle_por") VALUES (?, ?, ?, ?, ?, ?, ?)  [["nome", "fadsf"], ["descricao", "adfadf"], ["ativa", false], ["grupo_ad", "afda"], ["created_at", 2017-03-10 02:35:24 UTC], ["updated_at", 2017-03-10 02:35:24 UTC], ["controle_por", "Usuário"]]
---
  def create
    @rede = Rede.new(rede_params)

    respond_to do |format|
      if @rede.save

UPDATE "redes" SET "controle_por" = ?, "updated_at" = ? WHERE "redes"."id" = ?  [["controle_por", "Mac"], ["updated_at", 2017-03-10 02:43:05 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @rede.update(rede_params)

DELETE FROM "redes" WHERE "redes"."id" = ?  [["id", 2]]
---
  def destroy
    @rede.destroy

SELECT  "redes".* FROM "redes" WHERE "redes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_rede
      @rede = Rede.find(params[:id])