app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (nome like '%%' )
---
   def index
     @filtro ||= Hash.new
     @filtro[:nome] ||= "PRIMEIRAVEZ"

    unless @filtro[:nome].nil? and @filtro[:nome].blank? and @filtro[:nome]!= "PRIMEIRAVEZ"
      @users = User.search(params[:search])

INSERT INTO "users" ("login", "password_digest", "nome", "situacao", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = ?, "nome" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$Gig3kTOGP937VNad1IDnruvJT1q4325HYdIaZMcq4crHLoHH5J/7."], ["nome", "Lucas Santiago Miranda"], ["updated_at", 2016-10-23 14:02:27 UTC], ["id", 1]]
---
    def update
    respond_to do |format|
      if @user.update(user_params)